{
  "backend/main.mo": "Empty Motoko actor with no methods.",
  "feature_evidence.json": "Feature evidence report mapping feature requirements to related frontend files and components.",
  "frontend-file-summaries.txt": "Text file containing high‑level summaries of all frontend files for reference.",
  "frontend/index.css": "Global Tailwind-based dark theme styles and CSS variables for the app’s visual appearance.",
  "frontend/index.html": "HTML entry point loading Google Fonts and mounting the React app.",
  "frontend/public/deploy-marker.txt": "Deployment marker noting the latest deployment date and configuration fix.",
  "frontend/src/App.tsx": "Root React component that renders the ValentineFlow experience.",
  "frontend/src/components/FloatingHeartsBackground.tsx": "Generates and animates floating heart emojis using randomized positions and timing.",
  "frontend/src/components/pages/Page1Splash.tsx": "Page 1 showing apology text and a Next button at the bottom.",
  "frontend/src/components/pages/Page2Hold.tsx": "Page 2 showing hold‑you text with a grayscale image and a Next button.",
  "frontend/src/components/pages/Page3Apology.tsx": "Page 3 displaying a long apology paragraph, an image, and a Next button.",
  "frontend/src/components/pages/Page3Forgive.tsx": "Empty placeholder file for a Page 3 forgive component.",
  "frontend/src/components/pages/Page4ForgivePrompt.tsx": "Page 4 showing Yes/No forgiveness prompt with moving No button and final message reveal.",
  "frontend/src/components/pages/Page4Hug.tsx": "Empty placeholder file for a hug-themed page component.",
  "frontend/src/components/pages/Page5Final.tsx": "Empty placeholder file intended for a final page component.",
  "frontend/src/components/stages/Stage1.tsx": "Empty placeholder for Stage 1 component structure.",
  "frontend/src/components/stages/Stage2.tsx": "Empty placeholder for Stage 2 component structure.",
  "frontend/src/components/stages/Stage3Letter.tsx": "Empty placeholder for Stage 3 letter display component.",
  "frontend/src/components/StageTransition.tsx": "Wrapper applying enter/exit transition classes around page content.",
  "frontend/src/components/ValentineFlow.tsx": "Controls page navigation between four apology pages with timed transitions.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages an authenticated or anonymous backend actor with query invalidation.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for Internet Identity authentication, wrapping AuthClient creation, login, logout, and identity state management.",
  "frontend/src/index.css": "Defines global Tailwind-based dark theme styles, custom animations, typography, and UI element styling such as buttons, images, and hearts.",
  "frontend/src/main.tsx": "Bootstraps the React app, initializing QueryClient and wrapping the app with InternetIdentityProvider.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom fonts, colors mapped to CSS variables, radius settings, and animation/typography plugins.",
  "frontend/tsconfig.node.json": "TypeScript config for Node-side tooling, specifying module settings and included Vite config file.",
  "frontend/vite.config.ts": "Vite configuration enabling React, environment variable plugins, aliasing, build output settings, dev server proxying, and esbuild globals.",
  "project_state.json": "Metadata describing the project's goals, features, UI flow, and requirements for a dark-themed 4‑page interactive apology website."
}