{
  "backend/main.mo": "Defines an empty Motoko actor canister.",
  "feature_evidence.json": "Contains feature evidence metadata linking features to affected frontend files and components.",
  "frontend-file-summaries.txt": "Provides textual summaries for various frontend files and components.",
  "frontend/index.css": "Global Tailwind-based styles configuring theme variables, dark mode, and base styling.",
  "frontend/index.html": "HTML entry point loading Playfair Display font and mounting the React root.",
  "frontend/public/deploy-marker.txt": "Marker file noting the deployment date and configuration fix.",
  "frontend/src/App.tsx": "Root React component that renders the ValentineFlow experience.",
  "frontend/src/components/FloatingHeartsBackground.tsx": "Empty placeholder component file.",
  "frontend/src/components/pages/Page1Splash.tsx": "Page 1 shows the apology text and a Next button.",
  "frontend/src/components/pages/Page2Hold.tsx": "Page 2 shows the message, displays a user-uploaded image, and has a Next button.",
  "frontend/src/components/pages/Page3Apology.tsx": "Page 3 shows a romantic apology message with an uploaded image and a Next button.",
  "frontend/src/components/pages/Page3Forgive.tsx": "Empty placeholder file for an unused Page 3 forgive variant.",
  "frontend/src/components/pages/Page4ForgivePrompt.tsx": "Page 4 shows the forgiveness prompt with a Yes button and a moving No button.",
  "frontend/src/components/pages/Page4Hug.tsx": "Empty placeholder file for an unused hug page.",
  "frontend/src/components/pages/Page5Final.tsx": "Final page displaying the loving message and centered hugging GIF.",
  "frontend/src/components/stages/Stage1.tsx": "Empty placeholder stage component.",
  "frontend/src/components/stages/Stage2.tsx": "Empty placeholder stage component.",
  "frontend/src/components/stages/Stage3Letter.tsx": "Empty placeholder stage component.",
  "frontend/src/components/StageTransition.tsx": "Wraps page content with enter/exit transition classes based on state.",
  "frontend/src/components/ValentineFlow.tsx": "Controls the 5-page navigation flow with timed transitions and renders each page component.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages an authenticated or anonymous backend actor instance.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, login flow, and identity management.",
  "frontend/src/index.css": "Defines Tailwind layers, theme CSS variables, base typography, animations, and custom styles for buttons, text, and image containers.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers and imports global styles.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom fonts, color variables, radius settings, and animation/typography plugins.",
  "frontend/tsconfig.node.json": "TypeScript config for Node-related files, enabling ESNext modules and bundler resolution.",
  "frontend/vite.config.ts": "Sets up Vite with React, environment variable plugins, path aliases, build options, dev server proxy, and dependency optimization.",
  "project_state.json": "Describes the project’s requirements, page flow, theme, image rules, and tracked feature implementations."
}