{
  "kind": "build_request",
  "title": "Add standalone single-file apology website (dark theme) with 5-step flow and evasive No button",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Create a standalone, single-file apology website at `frontend/public/apology.html` that contains all CSS and JavaScript inline (no external CSS/JS files) and implements a 5-page flow navigated via a \"Next\" button.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "All CSS and JavaScript must be inside a single HTML file. Functional Pages (Navigation via 'Next' button)"
        ]
      },
      "acceptanceCriteria": [
        "A new file `frontend/public/apology.html` exists and renders without relying on the React app bundle.",
        "All styling is inside a `<style>` tag in the same HTML file and all behavior is inside a `<script>` tag in the same HTML file.",
        "A \"Next\" button advances sequentially through Page 1 → Page 2 → Page 3 → Page 4 → Page 5.",
        "The layout is responsive and usable on mobile screens."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Match the requested design system in `frontend/public/apology.html`: dark background `#0a0a0a`, text in white and rose pink accents, minimalist and classy styling, and load Google Fonts so body text uses `Poppins` and romantic headers use `Dancing Script`.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Use a clean, dark-themed UI (Background: #0a0a0a, Text: White/Rose Pink). Fonts: Use 'Poppins' for body and 'Dancing Script' (from Google Fonts) for romantic headers. Overall Style: Minimalist, decent, and responsive for mobile."
        ]
      },
      "acceptanceCriteria": [
        "`apology.html` imports `Poppins` and `Dancing Script` from Google Fonts.",
        "Body text uses `Poppins`; header/romantic text uses `Dancing Script`.",
        "The page background color is `#0a0a0a` (or a visually equivalent dark theme anchored on `#0a0a0a`).",
        "Primary text appears white, with rose-pink used as an accent color consistently."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Implement the exact page copy and structure in `frontend/public/apology.html`:\n- Page 1: Centered, bold text: \"I'm really sorry chlow! 🤌🏻\"\n- Page 2: Simple/classy text: \"I want to hold u everytime 🫠\"\n- Page 3: A sincere apology note displayed inside a soft-border glassmorphism box\n- Page 4: Question: \"Are u willing to forgive me bab? ❤️\" with Yes/No buttons\n- Page 5: Text: \"Awwwwweehh! Lvb u bab 💋\" and an image below it",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Page 1: Text \"I'm really sorry chlow! 🤌🏻\". (Centered, bold). Page 2: Text \"I want to hold u everytime 🫠\". Page 3: A sincere apology note with a soft border/glassmorphism box. Page 4 (The Game): Question: \"Are u willing to forgive me bab? ❤️\" Page 5 (Final): Text: \"Awwwwweehh! Lvb u bab 💋\""
        ]
      },
      "acceptanceCriteria": [
        "Each page shows the specified text exactly as provided (including emoji).",
        "Page 3 contains a visually distinct glassmorphism-style card with a soft border and readable apology note text.",
        "Page 4 displays the question and both Yes/No buttons.",
        "Page 5 displays the final text and an image element below it."
      ]
    },
    {
      "id": "REQ-4",
      "text": "On Page 4 inside `frontend/public/apology.html`, implement the forgiveness mini-game behavior:\n- \"Yes\" button is static and visibly glowing.\n- \"No\" button is always visible but effectively impossible to click: when the cursor hovers near it (or pointer/touch moves near it), it jumps to a random (x,y) position within the visible viewport/safe container area.\n- The evasion logic must be robust: the \"No\" button must never move outside the visible screen area (including on mobile) and must remain fully tappable-looking but not actually clickable.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "The Yes Button: Static and glowing. The No Button: Must be visible but impossible to click... jumps to a random (X, Y) coordinate within the screen... Ensure the 'No' button logic is robust so it doesn't move outside the visible screen area."
        ]
      },
      "acceptanceCriteria": [
        "The Yes button does not move and has a clear glow effect.",
        "The No button relocates when a pointer/mouse gets near it and also responds to touch/pointer movement on mobile.",
        "The No button never renders partially or fully off-screen after moving (verified by clamping within viewport bounds using measured button dimensions).",
        "Click/tap attempts on the No button do not successfully trigger a 'No' action; instead they cause the button to move again."
      ]
    },
    {
      "id": "REQ-5",
      "text": "On Page 5 inside `frontend/public/apology.html`, render the image using the exact placeholder tag `<img src='our-pic.jpg' />` and include an in-code comment instructing the user to rename their chosen photo file to `our-pic.jpg`; add a soft pink glow around the image.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Crucial: In the code, use a placeholder <img src='our-pic.jpg' /> and add a comment telling me to rename my image file to 'our-pic.jpg'. Add a soft pink glow around the image."
        ]
      },
      "acceptanceCriteria": [
        "`apology.html` contains an `<img src='our-pic.jpg' />` element on the final page.",
        "A nearby HTML comment explicitly instructs the user to rename their image file to `our-pic.jpg`.",
        "The image has a soft pink glow (e.g., via box-shadow/filter) and is styled to look polished on mobile and desktop."
      ]
    }
  ],
  "constraints": [
    "Frontend immutable paths must not be edited: `frontend/src/hooks/useInternetIdentity.ts`, `frontend/src/hooks/useInternetIdentity.tsx`, `frontend/src/hooks/useActor.ts`, `frontend/src/main.tsx`, and anything under `frontend/src/components/ui`.",
    "Do not add any backend changes; keep all work in the frontend static asset layer.",
    "User-facing text in the build request and in the created page must be in English (use the exact provided phrases)."
  ],
  "nonGoals": [
    "Do not replace the existing React-based flow/components unless explicitly requested; the deliverable is an additional standalone `apology.html` file.",
    "Do not integrate Internet Identity or any backend persistence for this apology website.",
    "Do not add external JS/CSS dependencies beyond loading Google Fonts."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}