{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Standalone dark-theme single-file apology page with 5-step flow and evasive No button",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Add a standalone single-file apology page (inline CSS/JS) with a 5-page flow navigated by a Next button.",
      "acceptanceCriteria": [
        "A new file `frontend/public/apology.html` exists and renders without relying on the React app bundle.",
        "All styling is inside a `<style>` tag in the same HTML file and all behavior is inside a `<script>` tag in the same HTML file.",
        "A \"Next\" button advances sequentially through Page 1 → Page 2 → Page 3 → Page 4 → Page 5.",
        "The layout is responsive and usable on mobile screens."
      ],
      "file_operations": [
        {
          "path": "frontend/public/apology.html",
          "operation": "create",
          "description": "Create a fully standalone HTML document that includes all CSS in a single inline <style> and all behavior in a single inline <script>; implement an internal 5-step view/state system with a Next button to advance sequentially and responsive layout rules for mobile."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Apply the requested dark minimalist design system and Google Fonts (Poppins + Dancing Script) within the standalone file.",
      "acceptanceCriteria": [
        "`apology.html` imports `Poppins` and `Dancing Script` from Google Fonts.",
        "Body text uses `Poppins`; header/romantic text uses `Dancing Script`.",
        "The page background color is `#0a0a0a` (or a visually equivalent dark theme anchored on `#0a0a0a`).",
        "Primary text appears white, with rose-pink used as an accent color consistently."
      ],
      "file_operations": [
        {
          "path": "frontend/public/apology.html",
          "operation": "modify",
          "description": "Add Google Fonts links for Poppins and Dancing Script in the <head>, set global typography (body uses Poppins; romantic headers use Dancing Script), and implement a dark theme anchored on #0a0a0a with white text and consistent rose-pink accents (buttons, borders, glows, highlights) using inline CSS."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Implement the exact 5-page copy/structure (including glassmorphism on Page 3 and image section on Page 5).",
      "acceptanceCriteria": [
        "Each page shows the specified text exactly as provided (including emoji).",
        "Page 3 contains a visually distinct glassmorphism-style card with a soft border and readable apology note text.",
        "Page 4 displays the question and both Yes/No buttons.",
        "Page 5 displays the final text and an image element below it."
      ],
      "file_operations": [
        {
          "path": "frontend/public/apology.html",
          "operation": "modify",
          "description": "Implement the exact page texts and layout structure for Pages 1–5 (including emoji), ensure Page 3 has a dedicated glassmorphism card container with a soft border and readable apology note, ensure Page 4 shows the question plus Yes/No buttons, and ensure Page 5 shows the final text with an image element below it."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Add the Page 4 forgiveness mini-game: static glowing Yes and an evasive No button that stays on-screen and can’t be successfully clicked.",
      "acceptanceCriteria": [
        "The Yes button does not move and has a clear glow effect.",
        "The No button relocates when a pointer/mouse gets near it and also responds to touch/pointer movement on mobile.",
        "The No button never renders partially or fully off-screen after moving (verified by clamping within viewport bounds using measured button dimensions).",
        "Click/tap attempts on the No button do not successfully trigger a 'No' action; instead they cause the button to move again."
      ],
      "file_operations": [
        {
          "path": "frontend/public/apology.html",
          "operation": "modify",
          "description": "Implement Page 4 interactions in inline JS: keep the Yes button stationary with a visible glow via inline CSS; for the No button, attach pointer/mouse proximity handling and touch/pointer-move handling to relocate it to random positions within a defined safe container; clamp positions using runtime measurements (container + button dimensions) to prevent off-screen placement; intercept click/tap on No to only trigger another move (no 'No' action)."
        }
      ]
    },
    {
      "id": "REQ-5",
      "summary": "On Page 5, render the image using the exact placeholder tag and include a rename instruction comment; style with a soft pink glow.",
      "acceptanceCriteria": [
        "`apology.html` contains an `<img src='our-pic.jpg' />` element on the final page.",
        "A nearby HTML comment explicitly instructs the user to rename their image file to `our-pic.jpg`.",
        "The image has a soft pink glow (e.g., via box-shadow/filter) and is styled to look polished on mobile and desktop."
      ],
      "file_operations": [
        {
          "path": "frontend/public/apology.html",
          "operation": "modify",
          "description": "On Page 5, include the exact tag `<img src='our-pic.jpg' />` and add a nearby HTML comment instructing the user to rename their chosen photo file to `our-pic.jpg`; style the image with a soft pink glow and responsive sizing/presentation suitable for mobile and desktop."
        }
      ]
    }
  ]
}